# ---------------------------------------------------------------------------------------------- REGISTRATION
language_0 = 'Hello! Select language:'
welcome_1 = 'Some information about the bot'
welcome_2 = "Rules and Policies"
already_0 = "Hello! Looks like we've already seen it) Shall we move on to the questionnaire?"
read = "I have read"


# -------------------------------------------------------------------------------------------- PERSONALITY
name = "name"
age_0 = "age"
age = "How old are you?"
age_next = "What's your name?"
age_return = "Sorry, you must be at least 16 years old to use the bot. If you entered the wrong age, please contact support."
age_wrong = "Write your age. Numbers only"
my_sex = "Now let's determine the breakdown"
sex_find = "Who are you interested in?"
all = "Whatever"
men = "Guys"
women = "Girls"
man = "I'm a guy"
woman = "I'm a girl"


# ---------------------------------------------------------------------------------------------- SYMBOLS
description = "Tell me about yourself? no more than 200 characters"
description_return = "Message too long, try to fit in 200 characters"
description_name = "Name is too long, need up to 20 characters"


# ---------------------------------------------------------------------------------------------- LOCATION
geo = "geolocation"
city = "Where are you from? Write your city or share your location"
location_true = "Location received"
city_return = "The city was not found in the list of available cities. Try again"
city_return_2 = "You sent something wrong, try again"
geo_share = "Share Location"


# ---------------------------------------------------------------------------------------------- PHOTO
photo = "Send me a picture"
photo_located_not = "Your photos were not found"
photo_not = "No photos found"


# ---------------------------------------------------------------------------------------------- PROFILE
profile_exotic = "Do you want to diversify your profile? Then click on the Menu button, and if you don’t want to, then let’s go look for people to talk to!"
radius = "The questionnaires in the given radius are over. Then there are questionnaires throughout the city."
not_found = "No profiles. Go through the forest."
profile = "Profiles"


# ---------------------------------------------------------------------------------------------- QUESTIONS
q_start = "Great, now let's move on to the survey"
q_1 = "Вы приходите домой после тяжелого рабочего дня. Ваш партнер предлагает вам провести вечер на большой вечеринке с его/ее друзьями. Что вы выберете?"
q_1_answer_0 = "Пойти на вечеринку"
q_1_answer_1 = "Предпочту спокойный вечер дома"

q_2 = "У вас возникла проблема, и вы не знаете, как ее решить. Ваш партнер предлагает вам свою помощь. Что вы выберете?"
q_2_answer_0 = "Приму помощь партнера"
q_2_answer_1 = "Попробую разобраться самостоятельно"

q_3 = "Вы играете в настольную игру, где есть определенные правила. В ходе игры ваш партнер предлагает изменить правила ради интереса. Что вы выберете?"
q_3_answer_0 = "Соблюдать установленные правила"
q_3_answer_1 = "Согласиться на изменения правил"

q_4 = "Вы планируете отпуск. Ваш партнер предлагает не делать жесткий план и оставить место для импровизации. Что вы выберете?"
q_4_answer_0 = "Поддержу планирование идеального отпуска"
q_4_answer_1 = "Готовы к импровизации и неожиданным приключениям"

q_5 = "Вам нужно решить сложную задачу, требующую технических знаний. Вы обращаетесь к партнеру за помощью. Что вы выберете?"
q_5_answer_0 = "Доверюсь техническим навыкам партнера"
q_5_answer_1 = "Попробую разобраться самостоятельно"

q_6 = "Возник спор или разногласие между вами и вашим партнером. Какое решение вы предпочтете?"
q_6_answer_0 = "Подойти к вопросу логически и аргументировано"
q_6_answer_1 = "Проявить эмпатию и уделить внимание чувствам партнера"

q_7 = "Вы планируете свидание в ресторане, но все столики заняты. Ваши действия:"
q_7_answer_0 = "Попытаетесь забронировать столик заранее"
q_7_answer_1 = "Будете искать альтернативное место для ужина на ходу"

q_8 = "Вы и ваш партнер смотрите на один и тот же пейзаж. Что привлекает ваше внимание?"
q_8_answer_0 = "Детали и особенности местности"
q_8_answer_1 = "Общая атмосфера и эмоциональное воздействие"

q_9 = "Вам предложили совместно участвовать в новом проекте, который потребует от вас изменения привычного расписания. Как вы отреагируете?"
q_9_answer_0 = "Приму предложение и подготовлюсь к переменам"
q_9_answer_1 = "Предпочту сохранить стабильность и рутину"

q_10 = "Вы готовите ужин вместе с вашим партнером. Ваш партнер предлагает добавить ананасы в пиццу. Как вы поступите?"
q_10_answer_0 = "Согласитесь на эксперимент с ананасами"
q_10_answer_1 = "Предпочтете классическую пиццу без ананасов"




# ---------------------------------------------------------------------------------------------- OPTIONS
in_menu = "You are in the menu: here you can change:"
in_menu_1 = "You are in the menu:"
events = "events"
menu = "Menu"
go = "Let's go!"
exception = "Complain/gift/delivery gives"
report = ""
online_present = ""
offline_present = ""


# ---------------------------------------------------------------------------------------------- USER COMMUNICATION
liked = "You were liked by a user"
What_write = "What do you want to write to the user?"
Like_and_wrote = "A user liked you and wrote the following message: "
not_found_user = "User not found. Try again."
empty_text = "You sent an empty message, try again."
wait = "Wait until someone likes your profile"
options = "👤 -- My profile | 🫂 -- Search for people | ❌ -- I don’t want to search for anyone"
weird_command = "Unknown command"
Bear_gift = "You were given a bear"
flowers_delivery = "your flower delivery could be here"