# ---------------------------------------------------------------------------------------------REGISTRATION
language_0 = 'Привет! Выбери язык:'
welcome_1 = 'Немного информации о боте'
welcome_2 = "Правила и политика"
already_0 = "Привет! Похоже мы уже виделись) Перейдем к анкете?"
read = "Я прочитал/а"


# ---------------------------------------------------------------------------------------------PERSONALITY
name = "имя"
age_0 = "возраст"
age = "Сколько тебе лет?"
age_next = "Как тебя зовут?"
age_return = "К сожалению, тебе должно быть минимум 16 лет чтобы пользоваться ботом. Если ты ввел/а неправильный возраст, обратись в поддержку."
age_wrong = "Напиши свой возраст. Только цифры"
my_sex = "Теперь определимся с полом"
sex_find = "Кто тебе интересен?"
all = "Всё равно"
men = "Парни"
women = "Девушки"
man = "Я парень"
woman = "Я девушка"


# ---------------------------------------------------------------------------------------------SYMBOLS
description = "Расскажи о себе? не больше 200 символов"
description_return = "Слишком длинное сообщение, попробуй уместиться в 200 символов"
description_name = "Имя слишком длинное, надо до 20 символов"


# ---------------------------------------------------------------------------------------------LOCATION
geo = "геопозиция"
city = "Откуда ты? Напиши город или поделись геопозицией"
location_true = "Локация получена"
city_return = "Город не найден в списке доступных городов. Попробуй еще раз"
city_return_2 = "Ты отправил что то не то, попробуй еще раз"
geo_share = "Поделиться Геопозицией"


# ---------------------------------------------------------------------------------------------PHOTO
photo = "Пришли мне картинку"
photo_located_not = "Ваши фотографии не найдены"
photo_not = "Фотографии не найдены"


# ---------------------------------------------------------------------------------------------PROFILE
profile_exotic = "Хочешь разнообразить анкету? Тогда нажми на кнопку Меню, а если не хочешь, то поехали искать тебе собеседников!"
radius = "Анкеты в заданном радиусе кончились. Далее идут анкеты по всему городу."
not_found = "Анкет нет. Иди лесом."
profile = "Анкеты"


# ---------------------------------------------------------------------------------------------QUESTIONS
q_start = "Отлично, теперь перейдем к опросу"
q_1 = "Вы приходите домой после тяжелого рабочего дня. Ваш партнер предлагает вам провести вечер на большой вечеринке с его/ее друзьями. Что вы выберете?"
q_1_answer_0 = "Пойти на вечеринку"
q_1_answer_1 = "Предпочту спокойный вечер дома"

q_2 = "У вас возникла проблема, и вы не знаете, как ее решить. Ваш партнер предлагает вам свою помощь. Что вы выберете?"
q_2_answer_0 = "Приму помощь партнера"
q_2_answer_1 = "Попробую разобраться самостоятельно"

q_3 = "Вы играете в настольную игру, где есть определенные правила. В ходе игры ваш партнер предлагает изменить правила ради интереса. Что вы выберете?"
q_3_answer_0 = "Соблюдать установленные правила"
q_3_answer_1 = "Согласиться на изменения правил"

q_4 = "Вы планируете отпуск. Ваш партнер предлагает не делать жесткий план и оставить место для импровизации. Что вы выберете?"
q_4_answer_0 = "Поддержу планирование идеального отпуска"
q_4_answer_1 = "Готовы к импровизации и неожиданным приключениям"

q_5 = "Вам нужно решить сложную задачу, требующую технических знаний. Вы обращаетесь к партнеру за помощью. Что вы выберете?"
q_5_answer_0 = "Доверюсь техническим навыкам партнера"
q_5_answer_1 = "Попробую разобраться самостоятельно"

q_6 = "Возник спор или разногласие между вами и вашим партнером. Какое решение вы предпочтете?"
q_6_answer_0 = "Подойти к вопросу логически и аргументировано"
q_6_answer_1 = "Проявить эмпатию и уделить внимание чувствам партнера"

q_7 = "Вы планируете свидание в ресторане, но все столики заняты. Ваши действия:"
q_7_answer_0 = "Попытаетесь забронировать столик заранее"
q_7_answer_1 = "Будете искать альтернативное место для ужина на ходу"

q_8 = "Вы и ваш партнер смотрите на один и тот же пейзаж. Что привлекает ваше внимание?"
q_8_answer_0 = "Детали и особенности местности"
q_8_answer_1 = "Общая атмосфера и эмоциональное воздействие"

q_9 = "Вам предложили совместно участвовать в новом проекте, который потребует от вас изменения привычного расписания. Как вы отреагируете?"
q_9_answer_0 = "Приму предложение и подготовлюсь к переменам"
q_9_answer_1 = "Предпочту сохранить стабильность и рутину"

q_10 = "Вы готовите ужин вместе с вашим партнером. Ваш партнер предлагает добавить ананасы в пиццу. Как вы поступите?"
q_10_answer_0 = "Согласитесь на эксперимент с ананасами"
q_10_answer_1 = "Предпочтете классическую пиццу без ананасов"




# ---------------------------------------------------------------------------------------------OPTIONS
in_menu = "Вы в меню: тут можно изменить:"
in_menu_1 = "Вы в меню:"
events = "мероприятия"
menu = "Меню"
go = "Погнали!"
exceptiton = "Пожаловаться/подарок/доставка подарка"
report = ""
online_present = ""
offline_present = ""


# ---------------------------------------------------------------------------------------------USERS COMMUNICATION
liked = "Вас лайкнул пользователь"
what_write = "Что вы хотите написать пользователю?"
liked_and_wrote = "Вас лайкнул пользователь и написал следующее сообщение: "
not_found_user = "Пользователь не найден. Попробуйте ещё раз."
empty_text = "Вы отправили пустое сообщение. Попробуйте ещё раз."
wait = "Подождем пока кто-то лайкнет вашу анкету"
options = "👤 -- Моя анкета | 🫂 -- Искать людей | ❌ -- я не хочу никого искать"
strange_command = "Неизвестная команда"
bear_gift = "Вам подарили мишку"
flowers_delivery = "тут могла бы быть ваша доставка цветов"